app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Testtttttt"], ["body", "test"], ["created_at", "2024-05-17 16:27:44.339401"], ["updated_at", "2024-05-17 16:27:44.339401"], ["status", "public"], ["user_id", 1]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Testing"], ["body", "testtttt"], ["updated_at", "2024-05-17 16:28:05.408194"], ["id", 8]]

  def report
    @article = Article.find(params[:id])
    @article.increment!(:reports_count)
    @article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "reports_count" = COALESCE("reports_count", 0) + ? WHERE "articles"."id" = ?  [["reports_count", 1], ["id", 29]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-05-17 20:05:36.887605"], ["status", "archived"], ["id", 30]]