app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", ""], ["body", ""], ["article_id", 2], ["created_at", "2024-05-15 19:00:51.028423"], ["updated_at", "2024-05-15 19:00:51.028423"], ["status", "archived"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 2], ["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy